tutorials/passive_scalar_pitzDaily/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
# Pre-configured pitzDaily case extended with a passive scalar `s`. The
# bundled `my_models/` package contains the reference plugin
# implementation that doc/tutorials/02-write-a-plugin-model walks the
# reader through; we put it on PYTHONPATH so the case is self-contained.
touch passive_scalar_pitzDaily.foam
restore0Dir

runApplication blockMesh

export PYTHONPATH="$PWD:${PYTHONPATH}"
runApplication neofoam solver incompressiblefluid

#------------------------------------------------------------------------------
